using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


/* Задача #2
 * Описать классы: 
 * Студент, Предмет, Преподаватель. Один студент может посещать несколько предметов, 
 * один преподаватель может вести несколько предметов. Все поля должны быть приватными, 
 * а доступ к изменению или чтению полей должен осуществляться через методы. 
 * В конечном итоге все студенты должны сформироваться в группу (массив). 
 * При вызове метода Info в классе Program который принимает группу студентов, 
 * на экран должна выводиться информация о каждом студенте: имя, год рождения, 
 * номер телефона, курс, количество предметов которые посещает, 
 * количество преподавателей, которые ведут эти предметы
 */
namespace Exercise2
{
    class Program
    {
        static void Main(string[] args)
        {
            List<Student> students;
        }

        static void Info(List<Student> students)
        {

        }

    }
}
